{
  "track": "AI Engineer",
  "courses": [
    {
      "id": 1,
      "courseName": "Python Fundamentals",
      "description": "Master the basics of Python programming. Learn syntax, data structures, functions, and object-oriented programming. This course is the foundation for all advanced AI and machine learning topics.",
      "instructor": "Alex Chen",
      "duration": "6 weeks",
      "level": "Beginner",
      "enrolled": "8,234 students",
      "modules": [
        {
          "id": 1,
          "title": "Python Basics",
          "shortDescription": "Variables, data types, and operators in Python.",
          "duration": "1 hour",
          "lessons": 6,
          "fullDescription": "Start your Python journey with variables, basic data types (integers, floats, strings, booleans), and operators. Understand how Python stores and manipulates data."
        },
        {
          "id": 2,
          "title": "Control Flow",
          "shortDescription": "If statements, loops, and conditional logic.",
          "duration": "1.5 hours",
          "lessons": 7,
          "fullDescription": "Master control flow with if-else statements, for loops, while loops, and nested conditions. Learn how to direct program execution based on conditions."
        },
        {
          "id": 3,
          "title": "Functions and Modules",
          "shortDescription": "Define functions, use built-in modules, and organize code.",
          "duration": "2 hours",
          "lessons": 9,
          "fullDescription": "Write reusable code with functions, understand scope and namespaces, and explore Python's rich standard library. Learn to organize your code into modules."
        }
      ]
    },
    {
      "id": 2,
      "courseName": "Machine Learning Essentials",
      "description": "Understand the core concepts of machine learning. Learn supervised learning, unsupervised learning, and how to build predictive models using scikit-learn and real datasets.",
      "instructor": "Dr. Maria Rodriguez",
      "duration": "8 weeks",
      "level": "Intermediate",
      "enrolled": "5,892 students",
      "modules": [
        {
          "id": 1,
          "title": "ML Fundamentals",
          "shortDescription": "Core concepts of supervised and unsupervised learning.",
          "duration": "1.5 hours",
          "lessons": 8,
          "fullDescription": "Understand what machine learning is, the difference between supervised and unsupervised learning, and the machine learning workflow. Learn about training and testing data."
        },
        {
          "id": 2,
          "title": "Regression Models",
          "shortDescription": "Linear regression, polynomial regression, and evaluation metrics.",
          "duration": "2 hours",
          "lessons": 10,
          "fullDescription": "Learn how to predict continuous values using regression. Understand linear and polynomial regression, cost functions, and how to evaluate model performance."
        },
        {
          "id": 3,
          "title": "Classification Models",
          "shortDescription": "Logistic regression, decision trees, and ensemble methods.",
          "duration": "2.5 hours",
          "lessons": 12,
          "fullDescription": "Build classifiers that predict categories. Explore logistic regression, decision trees, random forests, and gradient boosting for classification tasks."
        },
        {
          "id": 4,
          "title": "Clustering",
          "shortDescription": "K-means, hierarchical clustering, and DBSCAN.",
          "duration": "1.5 hours",
          "lessons": 7,
          "fullDescription": "Discover patterns in data using unsupervised learning. Master K-means clustering, hierarchical methods, and density-based clustering techniques."
        }
      ]
    },
    {
      "id": 3,
      "courseName": "Deep Learning with Neural Networks",
      "description": "Build and train deep neural networks using TensorFlow and Keras. Learn about CNNs, RNNs, and modern architectures for computer vision and natural language processing.",
      "instructor": "Prof. James Mitchell",
      "duration": "10 weeks",
      "level": "Advanced",
      "enrolled": "3,456 students",
      "modules": [
        {
          "id": 1,
          "title": "Neural Network Basics",
          "shortDescription": "Perceptrons, activation functions, and backpropagation.",
          "duration": "2 hours",
          "lessons": 9,
          "fullDescription": "Understand how neural networks work from first principles. Learn about neurons, activation functions, layers, and the backpropagation algorithm."
        },
        {
          "id": 2,
          "title": "Convolutional Neural Networks",
          "shortDescription": "CNN architecture for image recognition and computer vision.",
          "duration": "2.5 hours",
          "lessons": 11,
          "fullDescription": "Master CNNs for processing images. Learn about convolution, pooling, and modern architectures like ResNet and VGG. Build image classifiers."
        },
        {
          "id": 3,
          "title": "Recurrent Neural Networks",
          "shortDescription": "LSTM, GRU, and sequence modeling for time series data.",
          "duration": "2 hours",
          "lessons": 10,
          "fullDescription": "Process sequential data with RNNs, LSTMs, and GRUs. Learn to handle time series, text sequences, and build models that understand temporal patterns."
        },
        {
          "id": 4,
          "title": "Transfer Learning",
          "shortDescription": "Leverage pre-trained models for your own tasks.",
          "duration": "1.5 hours",
          "lessons": 7,
          "fullDescription": "Use pre-trained models to accelerate your projects. Learn fine-tuning strategies and how to adapt existing architectures for new tasks."
        }
      ]
    },
    {
      "id": 4,
      "courseName": "Natural Language Processing",
      "description": "Process and analyze human language with NLP techniques. Learn tokenization, embeddings, and transformers. Build chatbots and text classification systems.",
      "instructor": "Dr. Sarah Thompson",
      "duration": "9 weeks",
      "level": "Advanced",
      "enrolled": "4,123 students",
      "modules": [
        {
          "id": 1,
          "title": "NLP Fundamentals",
          "shortDescription": "Tokenization, preprocessing, and text analysis.",
          "duration": "1.5 hours",
          "lessons": 8,
          "fullDescription": "Start with the basics of NLP. Learn tokenization, stemming, lemmatization, and how to preprocess text data for machine learning models."
        },
        {
          "id": 2,
          "title": "Word Embeddings",
          "shortDescription": "Word2Vec, GloVe, and representation learning.",
          "duration": "2 hours",
          "lessons": 9,
          "fullDescription": "Understand how to represent words as dense vectors. Learn Word2Vec, GloVe, and FastText embeddings for semantic understanding."
        },
        {
          "id": 3,
          "title": "Transformer Models",
          "shortDescription": "BERT, GPT, and attention mechanisms.",
          "duration": "2.5 hours",
          "lessons": 11,
          "fullDescription": "Master modern NLP with transformers. Learn attention mechanisms, fine-tune BERT and GPT models for your applications."
        }
      ]
    }
  ]
}